tests/performance/artillery-api.yml
# Artillery REST API Performance Test Configuration
# MakanMakan API 負載測試配置

config:
  target: "http://localhost:8787"
  phases:
    # Phase 1: 暖身階段
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"

    # Phase 2: 負載增長
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up load"

    # Phase 3: 穩定負載
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"

    # Phase 4: 峰值負載
    - duration: 120
      arrivalRate: 100
      name: "Peak load"

    # Phase 5: 壓力測試
    - duration: 60
      arrivalRate: 150
      name: "Stress test"

    # Phase 6: 降載
    - duration: 60
      arrivalRate: 10
      name: "Cool-down"

  # 性能指標設定 — 對齊 CLAUDE.md 效能目標
  ensure:
    # HTTP 請求成功率 > 99%
    - http.request_rate:
        min: 5
    # 回應時間 P95 < 200ms（CLAUDE.md: P99 < 300ms，P95 應更嚴格）
    - http.response_time.p95:
        max: 200
    # 回應時間 P99 < 300ms（CLAUDE.md: API Response Time P99 < 300ms）
    - http.response_time.p99:
        max: 300
    # 錯誤率 < 1%
    - http.codes.500:
        max: 10 # 每秒最多 10 個 500 錯誤

  # HTTP 預設設定
  http:
    timeout: 10
    pool: 50 # 最大並發連接數
    headers:
      Origin: "http://localhost:8787"
      X-CSRF-Token: "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
      Cookie: "csrf_token=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"

  # 插件配置
  plugins:
    expect: {}
    metrics-by-endpoint:
      stripQueryString: false
      metricsNamespace: "api_metrics"

  # 環境變數
  variables:
    # 測試用戶
    testUsername: "{{ $processEnvironment.PERF_TEST_USERNAME }}"
    testPassword: "{{ $processEnvironment.PERF_TEST_PASSWORD }}"
    restaurantId: "{{ $processEnvironment.PERF_TEST_RESTAURANT_ID }}"

  # 負載測試 Payload 配置
  payload:
    path: "./test-data.csv"
    fields:
      - "username"
      - "email"
      - "restaurantId"
    skipHeader: true
    order: "sequence"
    cast: true

  # 測試處理器
  processor: "./artillery-api-processor.cjs"

before:
  flow:
    - function: "ensurePerformanceFixtures"

scenarios:
  # 場景 1: 認證流程測試 (20% 流量)
  - name: "Authentication Flow"
    weight: 20
    flow:
      # 1. 登入
      - function: "setDefaultVariables"
      - function: "authenticateUser"

      # 2. 驗證 Token
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # 3. 獲取當前用戶資訊
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
            - hasProperty: "data.id"

  # 場景 2: 菜單管理流程 (25% 流量)
  - name: "Menu Management Flow"
    weight: 25
    flow:
      # 1. 登入獲取 Token
      - function: "authenticateUser"

      # 2. 獲取完整菜單
      - get:
          url: "/api/v1/menu/{{ restaurantId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.data.menuItems[0].id"
              as: "menuItemId"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "data.menuItems"

      # 3. 獲取單個菜品詳情
      - get:
          url: "/api/v1/menu/items/{{ menuItemId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # 4. 搜尋菜品
      - get:
          url: "/api/v1/menu/{{ restaurantId }}/search"
          qs:
            search: "Performance"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # 場景 3: 訂單管理流程 (30% 流量)
  - name: "Order Management Flow"
    weight: 30
    flow:
      # 1. 認證
      - function: "authenticateUser"

      # 2. 獲取訂單列表
      - get:
          url: "/api/v1/orders"
          qs:
            restaurantId: "{{ restaurantId }}"
            page: 1
            pageSize: 20
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.data[0].id"
              as: "orderId"
          expect:
            - statusCode: 200

      # 3. 獲取訂單詳情
      - get:
          url: "/api/v1/orders/{{ orderId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # 4. 創建新訂單
      - post:
          url: "/api/v1/orders"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Origin: "http://localhost:8787"
            X-CSRF-Token: "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
            Cookie: "csrf_token=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
          json:
            restaurantId: "{{ restaurantId }}"
            tableId: "{{ tableId }}"
            items:
              - menuItemId: "{{ menuItemId }}"
                quantity: 2
                notes: "少辣"
              - menuItemId: "{{ secondaryMenuItemId }}"
                quantity: 1
          capture:
            - json: "$.data.id"
              as: "newOrderId"
          expect:
            - statusCode: 201

      # 5. 更新訂單狀態
      - put:
          url: "/api/v1/orders/{{ newOrderId }}/status"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Origin: "http://localhost:8787"
            X-CSRF-Token: "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
            Cookie: "csrf_token=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
          json:
            status: "confirmed"
          expect:
            - statusCode: 200

      # 6. 獲取訂單統計
      - get:
          url: "/api/v1/orders/stats"
          qs:
            restaurantId: "{{ restaurantId }}"
            timeRange: "today"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # 場景 4: 桌台管理流程 (15% 流量)
  - name: "Table Management Flow"
    weight: 15
    flow:
      # 1. 認證
      - function: "authenticateUser"

      # 2. 獲取桌台列表
      - get:
          url: "/api/v1/tables"
          qs:
            restaurantId: "{{ restaurantId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.data[0].id"
              as: "tableId"
          expect:
            - statusCode: 200

      # 3. 獲取桌台詳情
      - get:
          url: "/api/v1/tables/{{ tableId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # 4. 再次查詢桌台列表
      - get:
          url: "/api/v1/tables"
          qs:
            restaurantId: "{{ restaurantId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # 5. 再次獲取桌台詳情
      - get:
          url: "/api/v1/tables/{{ tableId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # 場景 5: 用戶管理流程 (10% 流量)
  - name: "User Management Flow"
    weight: 10
    flow:
      # 1. 認證（管理員）
      - function: "authenticateAdmin"

      # 2. 獲取用戶列表
      - get:
          url: "/api/v1/users"
          qs:
            restaurantId: "{{ restaurantId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # 3. 獲取當前用戶資訊
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # 場景 6: 混合讀取操作（高並發測試）
  - name: "Mixed Read Operations"
    weight: 50
    flow:
      - function: "authenticateUser"

      # 並發執行多個讀取操作
      - parallel:
          - get:
              url: "/api/v1/menu/{{ restaurantId }}"
              headers:
                Authorization: "Bearer {{ authToken }}"

          - get:
              url: "/api/v1/orders"
              qs:
                restaurantId: "{{ restaurantId }}"
              headers:
                Authorization: "Bearer {{ authToken }}"

          - get:
              url: "/api/v1/tables"
              qs:
                restaurantId: "{{ restaurantId }}"
              headers:
                Authorization: "Bearer {{ authToken }}"

  # 場景 7: 訂單統計（低頻率高負載）
  - name: "Order Statistics and Reports"
    weight: 5
    flow:
      - function: "authenticateUser"

      # 1. 訂單統計
      - get:
          url: "/api/v1/orders/stats"
          qs:
            restaurantId: "{{ restaurantId }}"
            timeRange: "today"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

      # 2. 導出訂單報表
      - post:
          url: "/api/v1/orders/export"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Origin: "http://localhost:8787"
            X-CSRF-Token: "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
            Cookie: "csrf_token=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
          json:
            restaurantId: "{{ restaurantId }}"
            format: "csv"
          expect:
            - statusCode: 200

  # 場景 8: 錯誤情境測試
  - name: "Error Scenarios"
    weight: 5
    flow:
      # 1. 未授權訪問
      - get:
          url: "/api/v1/orders"
          expect:
            - statusCode: 401

      # 2. 無效的 Token
      - get:
          url: "/api/v1/orders"
          headers:
            Authorization: "Bearer invalid-token"
          expect:
            - statusCode: 401

      # 3. 資源不存在
      - function: "authenticateUser"
      - get:
          url: "/api/v1/orders/99999999"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 404

      # 4. 驗證錯誤
      - post:
          url: "/api/v1/orders"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Origin: "http://localhost:8787"
            X-CSRF-Token: "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
            Cookie: "csrf_token=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"
          json:
            restaurantId: "{{ restaurantId }}"
            # 缺少必要欄位
          expect:
            - statusCode: 400

after:
  flow:
    - log: "Performance test completed. Check the report for detailed metrics."